Repository: aaloy/TLG_AntiJoin2SpamBot
Catalog: sources/locale/*/LC_MESSAGES/messages.po
Languages: ca, es

source: Help file {} not found
ca: Arixu d'ajuda {} no trobat.
es: Fichero de ayuda {} no encontrado

source: commands help file {} not found
ca: Arxiu d'ajuda de comandes {} no trobat
es: Archivo de ayuda de comandos {} no encontrado

source: User {} has ben considered a potential spammer
ca: L'usuari {} ha estat considerar com un spammer potencial
es: El usuario {} ha sido considerado como un spammer potencial

source: User not found
ca: Usuari no trobat
es: Usuario no encontrado

source: Actual Bot version: {}
ca: Versió actual del Bot: {}
es: Versión actual del bot: {}

source: These are the admins {}
ca: Aquests són els admins {}
es: Estos son los admins {}

source: I am a Bot that fight against Spammers that join groups to publish their annoying and unwanted info. Check /help command for more information about my usage.
ca: Hola! Sóc un Bot que lluita contra els spammers que s'uneixen als grups per publicar la seva informació no sol·licitada i enutjosa. Revisa la comanda /help per més informació sobre el meu ús.
es: Soy un Bot que lucha contra los spammers que se unen a los grupos para publicar su información molesta y no deseada. Ejecuta el comando /help para obtener más información sobre mi uso.

source: Hello, I am a Bot that fight against Spammers that join groups to publish their annoying and unwanted info. To work properly, give me Admin privileges.Check /help command for more information about my usage.
ca: Hola! Sóc un Bot que lluita contra els spammers que s'uneixen als grups per publicar la seva informació no sol·licitada i enutjosa.Revisa la comanda /help per més informació sobre el meu ús.
es: Soy un Bot que lucha contra los spammers que se unen a los grupos para publicar su información molesta y no deseada. Para funcionar necesitos que me des privilegios de Admin. Ejecuta el comando /help para obtener más información sobre mi uso.

source: Hello {}! Welcome! Please read the group norms in pinned message. This group as a bot (me) to fight against spammers. Use the /status command to know my parameters and /help to know more about me. Actual configuration: ———————————————— Number of messages to allow URLs: {} Hours until allow URLs: {}
ca: Hola {}! Benvingut/da! Si us plau llegeix les normes del grup que trobaràs en en missatge fitxat. Aquest grup té un bot (jo) per ajudar a lluitar contra els spammers. Fes servir la comanda /status per saber els meus paràmetres o la comanda /help per saber més sobre mi. Configuració actual: Nombre de missatges abans de permetre URLs als missatges: {} Hores abans de permetre URLs als missatges: {}
es: ¡Hola {}! ¡Bienvenido/a! Por favor, lee las normas del grupo que se encuentran en el mensaje fijado. Este grupo tiene un bot (yo) que se encarga de ayudar en la lucha contra los spammers. Configuración actual: Número de mensajes antes de permitir URLs en los mensajes: {} Número de horas antes de permitir URLs en los mensajes: {}

source: Just an Admin can use this command
ca: Sols un usuari Admin pot fer servir aquesta comanda
es: Solo un Admin puede usar este comando

source: This command just can be use in a private chat.
ca: Aquesta comanda sols pot ser utilitzada en un xat privat.
es: Este comando solamente se puede utilizar en un chat privado.

source: This command just can be use by the Owner of the Bot.
ca: Aquesta comanda sols pot ser utilitzada pel propietari del Bot.
es: Este comando solamente lo puede ejecutar el propietario del Bot.

source: Ok, tell me now the message that you want that I publish in all the Chats where I am... Use the command /notify_discard if you don't want to stop publishing it.
ca: Molt bé! Dona'm el missatge que vos que publiqui a tots els xats on soc .. Utilitza la comanda /notify_discard si no vols que s'aturi de publicar.
es: OK, dime ahora el mensaje que quieres publicar en los Chats en los que estoy ... Usa el comando /notify_discard si no quieres seguir con la publicación.

source: A massive publish is already running, please wait until it finish before send another.
ca: Una publicació massiva ja està en marxa, si us plau, espera que acabi per enviar-ne una altra.
es: Una publicación masiva se está ya ejecutando, por favor espera a que acabe antes de iniciar otra.

source: Message published in all the chats where I am.
ca: El missatge s'ha publicat a tots els xats on sóc.
es: Mensaje publicado en todos los canales en los que estoy.

source: Massive publish discarted.
ca: Publicació massiva descartada.
es: Publicación masiva descartada.

source: The massive publish is not running.
ca: La publicació massiva no està en marxa.
es: La publicación masiva no se está ejecutando.

source: Language changed to {}.
ca: Idioma canviat a {}.
es: Idioma cambiado a {}.

source: I am already in english. May you want to say: /language es
ca: Ja estic en anglès. Potser volies dir: /language es o /language ca
es: Ya estoy en inglés. Querías decir tal vez: /language es

source: Invalid language provided. The actual languages supported are english and spanish, change any of them using en or es. ' Example: /language en /language es
ca: Idioma no suportat. Els idiomes actuals que s'admeten són anglès, castellà i català. Pots canviar entre ells fent servir en, ca o es Per exemple: /language es
es: El idioma solicitado no es válido. En estos momentos los idiomas soportados son el inglés y el castellano. Puedes alternar entre ellos usando en o es. . Ejemplo: /language en /language es

source: The command needs a language to set (en - english, es - spanish). Example: /language en /language es
ca: La comanda necessita un idioma (es, en, ca) Exemple: /language en
es: El comando necesita un código de idioma (en - inglés, es - castellano). Ejemplo: /language en /language es

source: Actual configuration: ———————————————— Number of messages to allow URLs: {} Hours until allow URLs: {} Admins call when Spam detected: {} Allow users to add Bots: {} Anti-Spam: {}
ca: Configuració actual: ———————————————— Nombre de missatges per permetre URLs: {} Hores fins permetre URLs: {} Cridar els admins quan es detecti spam: {} Permetre als usuaris afegir Bots: {} Anti-Spam: {}
es: Configuración actual: ———————————————— Número de mensajes para permitir URLs: {} Horas antes de permitir URLs: {} Avisar a los Admins si hay spam: {} Permitir a los usuarios añadir Bots: {} Anti-Spam: {}

source: Time successfully changed. New users need to wait {} hours to get allowed to publish URLs in messages.
ca: El temps s'ha canviat. Els nous usuaris hauran d'esperar {} hores per poder publicar URLs en els seus missatges.
es: Tiempo cambiado. Los nuevos usuarios necesitan esperar {} horas antes de poder publicar URLs.

source: Invalid time provided. The hours need to be positives.
ca: El valor del temps indicat no és vàlid. Les hores han de ser positives.
es: El valor de tiempo proporcionado no es válido. Las horas necesitan ser positivas.

source: Invalid time provided. You need to specify how many hours want to set for a new user to wait, until get allowed to publish URLs in messages. Example (5h or 24h): /set_hours 5 /set_hours 24
ca: El valor del temps indicat no és vàlid. Les hores han de ser positives i has d'especificar el seu valor, que indica quan ha d'esperar un usuari per poder publicar URLs als missatges. Per exemple, si volem que esperi 5 hores: /set_hours 5
es: El valor de tiempo proporcionado no es válido. Necesitas especificar cuantas horas quieres que pasen antes de que a un usuario nuevo se le permita publicar URLs en sus mensajes. Ejemplo (5h or 24h): /set_hours 5 /set_hours 24

source: No time provided. You need to specify how many hours want to set for a new user to wait, until get allowed to publish URLs in messages. Example (5h or 24h): /set_hours 5 /set_hours 24
ca: El valor del temps indicat no és vàlid. Les hores han de ser positives i has d'especificar el seu valor, que indica quan ha d'esperar un usuari per poder publicar URLs als missatges. Per exemple, si volem que esperi 5 hores: /set_hours 5
es: No se ha proporcionado un valor de tiempo. Necesitas especificar cuantas horas quieres que pasen antes de que a un usuario nuevo se le permita publicar URLs en sus mensajes. Ejemplo (5h or 24h): /set_hours 5 /set_hours 24

source: Number of messages successfully changed. New users need to send {} messages to get allowed to publish URLs in messages.
ca: Nombre de missatges canviat correctament. Els nous usuaris necessiten enviar {} missatges abans de poder publicar URLs als seus missatges.
es: Número de mensajes cambiado. Los nuevos usuarios necesitarán enviar {} mensajes antes de poder publicar URLs en sus mensajes.

source: Invalid number of messages provided. The number of messages needs to be positive.
ca: Nombre de missatges incorrecte. El valor ha de ser positiu.
es: El valor para el número de mensajes no es correcto. Debe ser positivo.

source: Invalid number of messages provided. You need to specify how many messages want to set for a new user to wait, until get allowed to publish URLs in messages. Example (5 or 20): /set_messages 5 /set_messages 20
ca: Valor de nombre de missatges incorrecte. Necessites especificar quants missatges vols que els nous usuaris hagin d'esperar abans que se'ls permeti publicar URLs als seus missatges. Per exemple: /set_messages 5 /set_messages 20 per esperar 5 o 20 missatges respectivament.
es: El valor para el número de mensajes no es correcto. Necesitas especificar cuántos mensajes debe publicar un nuevo usuario antes de permitírsele publicar URLs en sus mensajes. Ejemplo (5 or 20): /set_messages 5 /set_messages 20

source: No number of messages provided. You need to specify how many messages want to set for a new user to wait, until get allowed to publish URLs in messages. Example (5 or 20): /set_messages 5 /set_messages 20
ca: Valor de nombre de missatges no especificat. Necessites especificar quants missatges vols que els nous usuaris hagin d'esperar abans que se'ls permeti publicar URLs als seus missatges. Per exemple: /set_messages 5 /set_messages 20 per esperar 5 o 20 missatges respectivament.
es: El valor para el número de mensajes noha sido especificado. Necesitas especificar cuántos mensajes debe publicar un nuevo usuario antes de permitírsele publicar URLs en sus mensajes. Ejemplo (5 or 20): /set_messages 5 /set_messages 20

source: User {} granted to publish URLs in messages.
ca: S'ha permés a l'usuari {} publicar URLs als seus missatges.
es: Se ha permitido al usuario {} publicar URLs en sus mensajes.

source: User {} is already allowed to publish URLs in messages.
ca: L'usuari {} ja té permés publicar URLs als seus missatges.
es: El usuario {} ya tenía permitido publicar URLs en sus mensajes.

source: User not found in my data base.
ca: No he trobat l'usuari dins la meva base de dades.
es: No se encontró al usuario en mi base de datos.

source: No user provided. You need to specify the user alias/name that we want to give permission to publish URLs in messages. Examples: /allow_user @mr_doe /allow_user Jhon Doe
ca: No s'ha indicat usuari. Necessites indicar el nom d'usuari o alies al qual vols que doni permisos per publicar URLs als missatges. Per exemple: /allow_user @mr_doe /allow_user John Doe
es: No se ha indicado usuario. Necesitas especificar un usuario alias/nombre al que quieras dar permisos para publicar URLs en sus mensajes. Ejemplos: /allow_user @mr_doe /allow_user Jhon Doe

source: Anti-Spam enabled. Stop it with /disable command.
ca: Bot anit-spam habilitat. Atuar'l amb la comanda /disable
es: Anti-Spam activado. Desactívalo con el comando /disable .

source: Anti-Spam disabled. Start it with /enable command.
ca: Bot anit-spam deshabilitat. Habilita'l amb la comanda /enable .
es: Anti-Spam desactivado. Actívalo con el comando /enable .

source: I am already enabled.
ca: Ja estic habilitat.
es: Ya estoy activo.

source: I am already disabled.
ca: Ja estic deshabilitat.
es: Ya estoy deshabilitado.

source: Anti-Spam message: ————————————————
ca: Missatge anti-spam: ————————————————
es: Mensaje anti-spam: ————————————————

source: Spam message detected, but I don't have permission for remove it. Please, give me administration privileges for delete messages ;)
ca: S'ha detectat un missatge com a spam, però no tenc permisos per borrar-lo. Si us plau, dona'm permisos d'administrador per poder borrar missatges ;)
es: Se ha detectado un mensaje de spam, pero no tengo permisos para eliminarlo. Por favor, dame permisos de administración para poder borrar mensajes. ;)

source: Message from user {} removed for the sake of a free of Spam Telegram.
ca: Missatges de l'usuari {} eliminat a fi de mantenir Telegram lliure d'Spam.
es: El mensaje del usuario {} se ha eliminado en aras de mantener Telegram libre de Spam.

source: New members need to write <b>{} messages</b> and wait <b>{} hours</b> to be allowed to publish URLs in their messages.
ca: Els nous membres necessiten escriure <b>{} missatges</b> i esperar <b>{} hores </b> per poder publicar URLs als seus missatges.
es: Los nuevos miembros necesitan escribir <b>{} mensajes</b> y espear <b>{} horas</b> antes de poder publicar URLs en sus mensajes.

source: Calling to Admins: {}
ca: Cridant als Admins: {}
es: Llamando a los Admins: {}

source: There is not Admins in this chat.
ca: No hi ha admins a aquest chat
es: No hay Admin en este chat.

source: Automatic call Admins when Spam is detected enabled.
ca: Cridada automàtica als Admins quan se detecta Spam habilitada.
es: Llamar automáticamente a los Admins si se detecta Spam activado.

source: Automatic call Admins when Spam is detected disabled.
ca: Cridada automàtica als Admins quan se detecta Spam deshabilitada.
es: Llamar automáticamente a los Admins si se detecta Spam desactivado.

source: Call Admins when Spam is detected is already enabled.
ca: Cridada automàtica als Admins quan se detecta Spam ja habilitada.
es: Llamar automáticamente a los Admins si se detecta Spam ya activado.

source: Call Admins when Spam is detected is already disabled.
ca: Cridada automàtica als Admins quan se detecta Spam ja deshabilitada.
es: Llamar automáticamente a los Admins si se detecta Spam ya desactivado.

source: The command needs enable/disable keyword. Example: /call_when_spam enable / call_when_spam disable
ca: La comanda necessita de la clau enable/disable. Exemple: /call_when_spam enable /call_when_spam disable
es: Debe indicar en el comando la clave enable/disable . Ejemplo: /call_when_spam enable / call_when_spam disable

source: Allow users to add Bots enabled.
ca: Permetre als usuaris afegir bots habilitat.
es: /call_when_spam enable / call_when_spam disable

source: Allow users to add Bots disabled.
ca: Permetre als usuaris afegir bots deshabilitat.
es: Permitir a los usuarios añadir Bots desactivado.

source: Allow users to add Bots is already enabled.
ca: Permetre als usuaris afegir bots ja habilitat.
es: Permitir a los usuarios añadir Bots ya activado.

source: Allow users to add Bots is already disabled.
ca: Permetre als usuaris afegir bots ja deshabilitat.
es: Permitir a los usuarios añadir Bots ya desactivado.

source: The command needs enable/disable keyword. Example: /users_add_bots enable /users_add_bots disable
ca: La comanda necessita de la clau enable/disable. Exemple: /users_add_bots enable /users_add_bots disable
es: El comando necesita el parámetro enable/disable. Ejemplo: /users_add_bots enable /users_add_bots disable

source: This group doesn't allow that users invite and add Bots. User {} try to add the Bot {}. The Bot has been kicked and banned.
ca: Aquest grup no permet que els usuaris convidin o afegeixin Bots. L'usuari {} ha intentat afegir el bot {}. El bot ha estat rebutjat i foragitat.
es: Este grupo no permite a los usuarios invitar o añadir Bots. El usuario {} trató de añadir al bot {}. El bot ha sido eliminado y bloqueado.

source: This group don't allow users to invite and add Bots. User {} has added the Bot {}, I try to kick the Bot, but I don't have permission to do it. Please, give me administration privileges for ban members ;)
ca: Aquest grup no permet que els usuaris convidin o afegeixin Bots. L'usuari {} ha intentat afegir el bot {}. S'ha intentat foragitar el bot, però no ha estat possible. Si us plau, dona'm permisos d'administrador per poder foragitar usuaris ;)
es: Este grupo no permite a los usuarios invitar o añadir Bots. El usuario {} trató de añadir al bot {}. He intentado banera al Bot pero no tengo permisos para hacerlo. Por favor, dadme permisos de administración. ;)

source: Can't use this command in the current chat.
ca: No puc usar aquesta comanda en aquest chat.
es: No puedo utilizar este comando en el chat actual.

source: Anti-Spam Warning: ———————————————— An user with a name that is too long has joined the chat. '{} has joined the chat.'
ca: Avís anti-spam: ———————————————— Un usuari amb el nom massa llarg s'ha afegit al chat. '{} s'ha afegit al chat.'
es: Aviso de Spam: ———————————————— Un usuario con un nombre muy largo se ha unido al chat. '{} se ha unido al chat.'

source: Anti-Spam Warning: ———————————————— An user with a name that is too long has joined the chat. But I don't have permission for remove the message. Please, give me administration privileges for delete messages ;) {} has joined the chat.
ca: Avís anti-spam: ———————————————— Un usuari amb el nom massa llarg s'ha afegit al chat. No tenc permisos per eliminar el missatge. Si us plau, dona'm permisos d'administrador per poder esborrar missatges ;) '{} s'ha afegit al chat.'
es: Aviso de Spam: ———————————————— Un usuario con un nombre muy largo se ha unido al chat. No tengo permisos para eliminar el mensaje. Por favor, dadme permisos de administración. {} se ha unido al chat.

source: Anti-Spam Warning: ———————————————— An user with a name that contains an URL has joined the chat. {} has joined the chat.
ca: Avís anti-spam: ———————————————— Un usuari amb una URL al nom s'ha afegit al chat. '{} s'ha afegit al chat.'
es: Aviso de Spam: ———————————————— Un usuario con una URL en su nombre se ha unido al chat. {} se unió al chat.

source: Anti-Spam Warning: ———————————————— An user with a name that contains an URL has joined the chat. But I don't have permission for remove the message. Please, give me administration privileges for delete messages ;) {} has joined the chat.
ca: Avís anti-spam: ———————————————— Un usuari amb el URLs al nom s'ha afegit al chat. No tenc permisos per eliminar el missatge. Si us plau, dona'm permisos d'administrador per poder esborrar missatges ;) '{} s'ha afegit al chat.'
es: Aviso de Spam: ———————————————— Un usuario con una URL en su nombre se ha unido al chat. No tengo permisos para eliminar el mensaje. Por favor, dadme permisos de administración para poder borrar el mensaje. {} se unió al chat.

source: The Bot has been added to a new group: - ID: {}
ca: El Bot s'ha afegit a un nou grup: -ID: {}
es: El Bot ha sido añadido a un nuevo grupo: - ID: {}

source: {}- Title: {}
ca: {}- Títol: {}
es: {}- Título: {}

source: {}- Title: Unknown
ca: {}- Titol: Desconegut
es: {}- Título: Desconocido

source: {}- Link: Unknown
ca: {}- Link: Desconegut
es: {}- Link: Desconocido

source: Hello, I am a Bot that fight against Spammers that join groups to publish their annoying and unwanted info. To work properly, give me Admin privileges. Check /help command for more information about my usage.
ca: Hola! Sóc un Bot que lluita contra els spammers que s'uneixen als grups per publicar la seva informació no sol·licitada i enutjosa. Per a poder funcionar com toca, dona'm permisos d'Admin. Revisa la comanda /help per més informació sobre el meu ús.
es: ¡Hola! Soy un Bot que lucha contra los Spammers que se unen a los grupos para publicar su información molesta y no solicitada. Para que pueda funcionar adecuadamente, necesito privilegios de Admin. Ejecuta el comando /help para tener más información sobre mi uso.
